{
  "lastUpdated": "2026-02-19T17:55:42Z",
  "critters": [
    {
      "id": "whitetail_deer",
      "name": "White-tailed Deer",
      "category": "mammals",
      "icon": "🦌",
      "summary": "Common woodland browser often seen near fields and feeders.",
      "fact": "White-tailed deer can run up to 30 miles per hour to escape predators.",
      "activeFact": "White-tailed deer can run up to 30 miles per hour to escape predators."
    },
    {
      "id": "black_bear",
      "name": "Black Bear",
      "category": "mammals",
      "icon": "🐻",
      "summary": "Largest forest mammal in Michigan woodlands.",
      "fact": "Black bears are excellent climbers and often escape danger by climbing trees quickly.",
      "activeFact": "Black bears have excellent memories and can remember food sources for years!"
    },
    {
      "id": "coyote",
      "name": "Coyote",
      "category": "mammals",
      "icon": "🐕",
      "summary": "Adaptable predator common in rural areas.",
      "fact": "Coyotes communicate using over a dozen distinct vocalizations, including howls, yips, and barks.",
      "activeFact": "Coyotes are highly adaptable and can live in deserts, forests, mountains, and even cities!"
    },
    {
      "id": "red_fox",
      "name": "Red Fox",
      "category": "mammals",
      "icon": "🦊",
      "summary": "Solitary hunter active in open woods and fields.",
      "fact": "Red foxes have excellent hearing and can detect small animals moving underground.",
      "activeFact": "Red foxes use their bushy tails for balance and to keep warm during cold weather."
    },
    {
      "id": "gray_fox",
      "name": "Gray Fox",
      "category": "mammals",
      "icon": "🦊",
      "summary": "Smaller fox species able to climb trees.",
      "fact": "Gray foxes have retractable claws, which help them climb trees more effectively than other canids.",
      "activeFact": "Gray foxes can climb trees, an unusual skill for members of the dog family!"
    },
    {
      "id": "bobcat",
      "name": "Bobcat",
      "category": "mammals",
      "icon": "🐈",
      "summary": "Elusive woodland feline predator.",
      "fact": "Bobcats have excellent night vision, helping them hunt effectively in low-light conditions.",
      "activeFact": "Bobcats can leap up to 10 feet high, helping them catch prey and climb trees quickly!"
    },
    {
      "id": "porcupine",
      "name": "Porcupine",
      "category": "mammals",
      "icon": "🦔",
      "summary": "Slow-moving rodent protected by quills.",
      "fact": "Porcupines can swim well and use their quills as underwater defense against predators.",
      "activeFact": "Porcupines have thousands of sharp quills that detach easily to protect them from predators."
    },
    {
      "id": "beaver",
      "name": "Beaver",
      "category": "mammals",
      "icon": "🦫",
      "summary": "Dam-building wetland engineer.",
      "fact": "Beavers use their large, strong teeth to cut down trees and gather materials for building lodges.",
      "activeFact": "Beavers build dams to create ponds, helping protect their homes from predators and harsh weather."
    },
    {
      "id": "muskrat",
      "name": "Muskrat",
      "category": "mammals",
      "icon": "🦫",
      "summary": "Small aquatic rodent near ponds and streams.",
      "fact": "Muskrats have partially webbed hind feet, making them excellent swimmers in wetlands and marshes.",
      "activeFact": "Muskrats build dome-shaped lodges from vegetation, similar to beavers, but much smaller and cozier!"
    },
    {
      "id": "mink",
      "name": "Mink",
      "category": "mammals",
      "icon": "🐾",
      "summary": "Semi-aquatic predator along shorelines.",
      "fact": "Minks use scent glands to mark territory, communicating with other minks through unique odors.",
      "activeFact": "Minks have waterproof fur, helping them stay dry and warm while swimming underwater for food!"
    },
    {
      "id": "fisher",
      "name": "Fisher",
      "category": "mammals",
      "icon": "🐾",
      "summary": "Forest carnivore related to weasels.",
      "fact": "Fishers use scent marking to communicate territory boundaries and avoid confrontations with other fishers.",
      "activeFact": "Fishers are skilled climbers and can even chase prey up trees!"
    },
    {
      "id": "river_otter",
      "name": "River Otter",
      "category": "mammals",
      "icon": "🦦",
      "summary": "Playful aquatic predator found near rivers.",
      "fact": "River otters use their sensitive whiskers to detect prey movements in murky water.",
      "activeFact": "River otters can hold their breath underwater for up to eight minutes while hunting fish."
    },
    {
      "id": "gray_squirrel",
      "name": "Eastern Gray Squirrel",
      "category": "mammals",
      "icon": "🐿️",
      "summary": "Tree squirrel common at feeders.",
      "fact": "Eastern Gray Squirrels communicate using tail flicks to warn others of nearby predators.",
      "activeFact": "Eastern Gray Squirrels can rotate their ankles 180 degrees to climb down trees headfirst!"
    },
    {
      "id": "red_squirrel",
      "name": "American Red Squirrel",
      "category": "mammals",
      "icon": "🐿️",
      "summary": "Small territorial woodland squirrel.",
      "fact": "American Red Squirrels use loud chattering calls to communicate and warn others of nearby predators or intruders.",
      "activeFact": "American Red Squirrels defend territories year-round, storing food in scattered caches called middens."
    },
    {
      "id": "chipmunk",
      "name": "Chipmunk",
      "category": "mammals",
      "icon": "🐿️",
      "summary": "Ground squirrel known for cheek pouches.",
      "fact": "Chipmunks communicate using high-pitched chirps to warn others of nearby predators.",
      "activeFact": "Chipmunks have cheek pouches that can expand to carry food back to their burrows for storage."
    },
    {
      "id": "snowshoe_hare",
      "name": "Snowshoe Hare",
      "category": "mammals",
      "icon": "🐇",
      "summary": "Forest rabbit with seasonal coat change.",
      "fact": "Snowshoe hares have large hind feet that act like snowshoes, helping them move quickly on snow.",
      "activeFact": "Snowshoe hares change fur color seasonally, turning white in winter to blend with snow and brown in summer."
    },
    {
      "id": "cottontail",
      "name": "Eastern Cottontail",
      "category": "mammals",
      "icon": "🐇",
      "summary": "Common backyard rabbit species.",
      "fact": "Eastern Cottontails use their large hind feet to quickly zigzag and evade predators while running.",
      "activeFact": "Eastern Cottontails can run up to 18 miles per hour to escape predators!"
    },
    {
      "id": "raccoon",
      "name": "Raccoon",
      "category": "night",
      "icon": "🦝",
      "summary": "Nocturnal omnivore with dexterous paws.",
      "fact": "Raccoons use their remarkable memory to remember solutions to tasks for at least three years.",
      "activeFact": "Raccoons have highly sensitive front paws that help them identify objects by touch, even underwater!"
    },
    {
      "id": "opossum",
      "name": "Opossum",
      "category": "night",
      "icon": "🐀",
      "summary": "North America's only marsupial.",
      "fact": "Opossums play dead as a defense, drooling and emitting a foul odor to deter predators.",
      "activeFact": "Opossums play dead to avoid predators, slowing their heartbeat and breathing to appear lifeless."
    },
    {
      "id": "skunk",
      "name": "Striped Skunk",
      "category": "night",
      "icon": "🦨",
      "summary": "Night forager known for defensive spray.",
      "fact": "Striped skunks have a keen sense of smell that helps them locate insects and small prey at night.",
      "activeFact": "Striped skunks can accurately spray their smelly liquid up to 10 feet to deter predators!"
    },
    {
      "id": "flying_squirrel",
      "name": "Flying Squirrel",
      "category": "night",
      "icon": "🐿️",
      "summary": "Gliding nocturnal tree squirrel.",
      "fact": "Flying squirrels can glide up to 150 feet, using controlled movements to steer and land precisely.",
      "activeFact": "Flying squirrels glide by spreading a flap of skin called a patagium between their legs."
    },
    {
      "id": "little_brown_bat",
      "name": "Little Brown Bat",
      "category": "night",
      "icon": "🦇",
      "summary": "Common insect-eating bat species.",
      "fact": "Little Brown Bats can live over 30 years, making them one of the longest-living bats in North America.",
      "activeFact": "Little Brown Bats can eat up to 1,000 mosquitoes in an hour—nature’s own nighttime pest control!"
    },
    {
      "id": "big_brown_bat",
      "name": "Big Brown Bat",
      "category": "night",
      "icon": "🦇",
      "summary": "Large bat active near structures.",
      "fact": "Big Brown Bats can live over 20 years, making them one of the longest-lived bat species.",
      "activeFact": "Big Brown Bats use echolocation to catch insects, helping control mosquito populations naturally at night!"
    },
    {
      "id": "barred_owl",
      "name": "Barred Owl",
      "category": "night",
      "icon": "🦉",
      "summary": "Woodland owl known for 'who cooks for you' call.",
      "fact": "Barred Owls hunt mostly at night but can often be active during the day as well.",
      "activeFact": "Barred Owls can mimic the calls of other birds to confuse their prey or rivals."
    },
    {
      "id": "great_horned_owl",
      "name": "Great Horned Owl",
      "category": "night",
      "icon": "🦉",
      "summary": "Large powerful nocturnal raptor.",
      "fact": "Great Horned Owls can rotate their heads up to 270 degrees to spot prey without moving their bodies.",
      "activeFact": "Great Horned Owls can rotate their heads up to 270 degrees without harming blood flow!"
    },
    {
      "id": "bluejay",
      "name": "Blue Jay",
      "category": "birds",
      "icon": "🐦",
      "summary": "Bold feeder visitor with loud calls.",
      "fact": "Blue Jays use strong, loud calls to communicate and alert other birds about nearby predators.",
      "activeFact": "Blue Jays can mimic hawk calls to scare away other birds and protect their territory."
    },
    {
      "id": "cardinal",
      "name": "Northern Cardinal",
      "category": "birds",
      "icon": "🐦‍⬛",
      "summary": "Bright red year-round songbird.",
      "fact": "Northern Cardinal females use softer songs to communicate and maintain pair bonds with their mates.",
      "activeFact": "Northern Cardinals are one of the few birds where both males and females sing beautifully."
    },
    {
      "id": "chickadee",
      "name": "Black-capped Chickadee",
      "category": "birds",
      "icon": "🐤",
      "summary": "Small energetic feeder regular.",
      "fact": "Black-capped Chickadees use their distinctive “chick-a-dee-dee” call to communicate danger levels.",
      "activeFact": "Black-capped Chickadees can remember hundreds of hiding spots for their food throughout the winter."
    },
    {
      "id": "titmouse",
      "name": "Tufted Titmouse",
      "category": "birds",
      "icon": "🐤",
      "summary": "Curious small woodland songbird.",
      "fact": "Tufted Titmice often store sunflower seeds in bark crevices to eat later during winter.",
      "activeFact": "Tufted Titmice use their strong feet to cling upside down while searching for insects on tree bark!"
    },
    {
      "id": "nuthatch",
      "name": "White-breasted Nuthatch",
      "category": "birds",
      "icon": "🐦",
      "summary": "Tree climber often moving headfirst down bark.",
      "fact": "White-breasted Nuthatches use bark crevices to store seeds and insects for later meals.",
      "activeFact": "White-breasted Nuthatches can climb down trees headfirst, unlike many other birds!"
    },
    {
      "id": "downy_woodpecker",
      "name": "Downy Woodpecker",
      "category": "birds",
      "icon": "🐦",
      "summary": "Small woodpecker common at feeders.",
      "fact": "Downy Woodpeckers are the smallest woodpeckers in North America, measuring about 6-7 inches long.",
      "activeFact": "Downy Woodpeckers are the smallest woodpeckers in North America, about the size of a sparrow!"
    },
    {
      "id": "hairy_woodpecker",
      "name": "Hairy Woodpecker",
      "category": "birds",
      "icon": "🐦",
      "summary": "Larger look-alike of the downy.",
      "fact": "Hairy Woodpeckers have a long tongue with barbs to extract insects from tree holes.",
      "activeFact": "Hairy Woodpeckers drum on trees to find insects, not just to communicate with other woodpeckers!"
    },
    {
      "id": "pileated_woodpecker",
      "name": "Pileated Woodpecker",
      "category": "birds",
      "icon": "🪵",
      "summary": "Large crested forest woodpecker.",
      "fact": "Pileated Woodpeckers can drum loudly to communicate and mark their territory through the forest.",
      "activeFact": "Pileated Woodpeckers can drill holes 3 inches wide to find insects hiding deep in trees!"
    },
    {
      "id": "red_bellied_woodpecker",
      "name": "Red-bellied Woodpecker",
      "category": "birds",
      "icon": "🐦",
      "summary": "Common woodland woodpecker species.",
      "fact": "Red-bellied Woodpeckers use their long tongues to extract insects from deep tree bark crevices.",
      "activeFact": "Red-bellied Woodpeckers have a strong, chisel-like beak to drill into tree bark for insects."
    },
    {
      "id": "mourning_dove",
      "name": "Mourning Dove",
      "category": "birds",
      "icon": "🕊️",
      "summary": "Gentle ground-feeding dove.",
      "fact": "Mourning Doves can fly up to 55 miles per hour to escape predators.",
      "activeFact": "Mourning Doves can fly up to 55 miles per hour, making them surprisingly fast fliers!"
    },
    {
      "id": "goldfinch",
      "name": "American Goldfinch",
      "category": "birds",
      "icon": "🐦",
      "summary": "Bright yellow seasonal finch.",
      "fact": "American Goldfinches eat mostly seeds and have a unique diet low in insects compared to other songbirds.",
      "activeFact": "American Goldfinches molt twice a year, changing from bright yellow in summer to duller feathers in winter!"
    },
    {
      "id": "junco",
      "name": "Dark-eyed Junco",
      "category": "birds",
      "icon": "🐦",
      "summary": "Winter feeder bird.",
      "fact": "Dark-eyed Juncos use a variety of calls to communicate, including different songs for territory and mating.",
      "activeFact": "Dark-eyed Juncos change feather colors seasonally, showing brighter plumage during breeding for attracting mates!"
    },
    {
      "id": "house_finch",
      "name": "House Finch",
      "category": "birds",
      "icon": "🐦",
      "summary": "Small social seed-eater.",
      "fact": "Male House Finches have bright red plumage, which they obtain from pigments in their diet.",
      "activeFact": "House Finches have red feathers on their heads, which actually come from pigments in the foods they eat!"
    },
    {
      "id": "purple_finch",
      "name": "Purple Finch",
      "category": "birds",
      "icon": "🐦",
      "summary": "Rosy-colored woodland finch.",
      "fact": "Purple Finches eat seeds and fruits, often cracking them open with their strong, cone-shaped beaks.",
      "activeFact": "Purple Finches sing sweet, melodious songs that help them attract mates and mark their territory."
    },
    {
      "id": "wild_turkey",
      "name": "Wild Turkey",
      "category": "birds",
      "icon": "🦃",
      "summary": "Large ground bird common in Michigan.",
      "fact": "Wild turkeys can swim across rivers using steady, strong paddling with their legs.",
      "activeFact": "Wild turkeys can fly at speeds up to 55 miles per hour for short bursts!"
    },
    {
      "id": "ruffed_grouse",
      "name": "Ruffed Grouse",
      "category": "birds",
      "icon": "🐓",
      "summary": "Forest bird known for drumming display.",
      "fact": "Ruffed Grouse change their feather patterns seasonally for better camouflage in their woodland habitats.",
      "activeFact": "Ruffed Grouse create a drumming sound by beating their wing feathers to attract mates and mark territory."
    },
    {
      "id": "sandhill_crane",
      "name": "Sandhill Crane",
      "category": "birds",
      "icon": "🕊️",
      "summary": "Tall wetland bird with loud call.",
      "fact": "Sandhill Cranes communicate with loud, trumpeting calls that can travel over distances during migration.",
      "activeFact": "Sandhill Cranes perform graceful, synchronized dances to strengthen pair bonds and communicate with each other."
    },
    {
      "id": "crow",
      "name": "American Crow",
      "category": "birds",
      "icon": "🐦‍⬛",
      "summary": "Highly intelligent black bird.",
      "fact": "American Crows communicate with a variety of calls, showing complex social behavior within their groups.",
      "activeFact": "American Crows can recognize human faces and remember if someone is a threat for years."
    },
    {
      "id": "raven",
      "name": "Common Raven",
      "category": "birds",
      "icon": "🐦‍⬛",
      "summary": "Large intelligent corvid species.",
      "fact": "Common Ravens use problem-solving skills to find food, sometimes dropping nuts onto roads for cars to crack.",
      "activeFact": "Common Ravens can mimic sounds, including human speech and animal calls, showing impressive intelligence."
    },
    {
      "id": "red_tailed_hawk",
      "name": "Red-tailed Hawk",
      "category": "birds",
      "icon": "🦅",
      "summary": "Common soaring raptor.",
      "fact": "Red-tailed Hawks often soar in wide circles to conserve energy while searching for prey below.",
      "activeFact": "Red-tailed Hawks can spot prey from over a mile away using their incredible eyesight!"
    },
    {
      "id": "coopers_hawk",
      "name": "Cooper’s Hawk",
      "category": "birds",
      "icon": "🦅",
      "summary": "Fast woodland hunting hawk.",
      "fact": "Cooper’s Hawks use surprise and swift strikes to catch birds and small mammals mid-air with precision.",
      "activeFact": "Cooper’s Hawks are skilled flyers that use surprise attacks to catch birds mid-air."
    },
    {
      "id": "mallard",
      "name": "Mallard Duck",
      "category": "water",
      "icon": "🦆",
      "summary": "Common freshwater duck.",
      "fact": "Male mallards have a distinctive glossy green head that helps them attract mates during breeding season.",
      "activeFact": "Mallard ducks can recognize and remember individual human faces for years."
    },
    {
      "id": "wood_duck",
      "name": "Wood Duck",
      "category": "water",
      "icon": "🦆",
      "summary": "Colorful duck nesting in tree cavities.",
      "fact": "Wood Ducks have striking iridescent feathers that shimmer in sunlight, making them one of the most colorful ducks.",
      "activeFact": "Wood Ducks nest in tree cavities, making them unique among North American waterfowl species."
    },
    {
      "id": "canada_goose",
      "name": "Canada Goose",
      "category": "water",
      "icon": "🪿",
      "summary": "Migratory waterfowl species.",
      "fact": "Canada Geese are known for their loud honking, which helps keep flocks together during flight.",
      "activeFact": "Canada Geese can fly thousands of miles during migration, often forming a distinctive V-shaped flying pattern."
    },
    {
      "id": "great_blue_heron",
      "name": "Great Blue Heron",
      "category": "water",
      "icon": "🦤",
      "summary": "Large fish-eating wading bird.",
      "fact": "Great Blue Herons use their long legs to wade through water while hunting amphibians and small mammals.",
      "activeFact": "Great Blue Herons can fly at speeds up to 30 miles per hour while hunting for fish."
    },
    {
      "id": "painted_turtle",
      "name": "Painted Turtle",
      "category": "water",
      "icon": "🐢",
      "summary": "Common basking turtle.",
      "fact": "Painted turtles can live over 30 years in the wild, showing remarkable longevity for reptiles.",
      "activeFact": "Painted Turtles can absorb oxygen through their skin while underwater, helping them stay submerged longer."
    },
    {
      "id": "snapping_turtle",
      "name": "Snapping Turtle",
      "category": "water",
      "icon": "🐢",
      "summary": "Large aquatic turtle.",
      "fact": "Snapping turtles can hold their breath underwater for up to 40 hours during hibernation.",
      "activeFact": "Snapping turtles have powerful jaws and can snap shut in less than a second to catch prey!"
    },
    {
      "id": "bluegill",
      "name": "Bluegill",
      "category": "water",
      "icon": "🐟",
      "summary": "Common freshwater panfish.",
      "fact": "Bluegill sunfish use their gill covers to create sounds for communication during mating season.",
      "activeFact": "Bluegill fish can hear sounds up to 1,600 Hz, helping them detect predators quickly underwater!"
    },
    {
      "id": "largemouth_bass",
      "name": "Largemouth Bass",
      "category": "water",
      "icon": "🐟",
      "summary": "Popular freshwater predator fish.",
      "fact": "Largemouth bass use their lateral line to detect vibrations and locate prey in murky waters.",
      "activeFact": "Largemouth bass can grow over 2 feet long and use their big mouths to ambush prey!"
    },
    {
      "id": "yellow_perch",
      "name": "Yellow Perch",
      "category": "water",
      "icon": "🐟",
      "summary": "Schooling freshwater fish.",
      "fact": "Yellow Perch can lay up to 100,000 eggs each spring, supporting healthy fish populations.",
      "activeFact": "Yellow Perch have vibrant yellow bodies with dark vertical stripes, making them easy to spot underwater!"
    },
    {
      "id": "northern_pike",
      "name": "Northern Pike",
      "category": "water",
      "icon": "🐟",
      "summary": "Fast ambush predator fish.",
      "fact": "Northern Pike have a unique vertebral count that helps them swim quickly while staying perfectly still.",
      "activeFact": "Northern Pike can grow over 4 feet long and use sharp teeth to catch their prey swiftly!"
    },
    {
      "id": "spring_peeper",
      "name": "Spring Peeper",
      "category": "amphib_reptile",
      "icon": "🐸",
      "summary": "Tiny frog with loud spring calls.",
      "fact": "Spring Peepers have sticky toe pads that help them climb trees and vegetation with ease.",
      "activeFact": "Spring Peepers are tiny frogs known for their loud, high-pitched calls signaling early spring."
    },
    {
      "id": "bullfrog",
      "name": "American Bullfrog",
      "category": "amphib_reptile",
      "icon": "🐸",
      "summary": "Large pond frog.",
      "fact": "American Bullfrogs are excellent swimmers, using powerful hind legs to leap great distances in water.",
      "activeFact": "American Bullfrogs can grow up to 8 inches long, making them one of North America's largest frogs!"
    },
    {
      "id": "green_frog",
      "name": "Green Frog",
      "category": "amphib_reptile",
      "icon": "🐸",
      "summary": "Common shoreline frog.",
      "fact": "Green frogs are excellent jumpers, leaping up to 3 feet to catch insects and escape predators.",
      "activeFact": "Green frogs can jump over 20 times their body length to escape predators quickly!"
    },
    {
      "id": "leopard_frog",
      "name": "Leopard Frog",
      "category": "amphib_reptile",
      "icon": "🐸",
      "summary": "Spotted frog near wetlands.",
      "fact": "Leopard frogs use their distinctive spots as camouflage to blend into grassy and watery habitats.",
      "activeFact": "Leopard frogs get their name from their distinctive dark spots that look like a leopard’s coat."
    },
    {
      "id": "garter_snake",
      "name": "Garter Snake",
      "category": "amphib_reptile",
      "icon": "🐍",
      "summary": "Common harmless snake.",
      "fact": "Garter snakes use their tongue to sense chemical signals, helping them locate prey and navigate environments.",
      "activeFact": "Garter snakes can swim and often hunt amphibians in water, making them excellent swimmers!"
    },
    {
      "id": "water_snake",
      "name": "Water Snake",
      "category": "amphib_reptile",
      "icon": "🐍",
      "summary": "Semi-aquatic snake species.",
      "fact": "Water snakes use their flattened tails to swim efficiently through water when chasing prey or escaping threats.",
      "activeFact": "Water snakes can hold their breath underwater for up to two hours while hunting or hiding from predators!"
    },
    {
      "id": "milk_snake",
      "name": "Eastern Milk Snake",
      "category": "amphib_reptile",
      "icon": "🐍",
      "summary": "Non-venomous woodland snake.",
      "fact": "Eastern Milk Snakes help control rodent populations, making them beneficial for farmland and gardens.",
      "activeFact": "Eastern Milk Snakes mimic venomous coral snakes with similar coloring to avoid predators."
    },
    {
      "id": "monarch",
      "name": "Monarch Butterfly",
      "category": "insects",
      "icon": "🦋",
      "summary": "Migratory butterfly species.",
      "fact": "Monarch caterpillars exclusively eat milkweed, which makes them toxic to predators throughout their lives.",
      "activeFact": "Monarch butterflies migrate up to 3,000 miles to Mexico each fall, one of nature’s greatest journeys!"
    },
    {
      "id": "swallowtail",
      "name": "Swallowtail Butterfly",
      "category": "insects",
      "icon": "🦋",
      "summary": "Large colorful butterfly.",
      "fact": "Swallowtail caterpillars can mimic bird droppings to avoid being eaten by predators.",
      "activeFact": "Swallowtail butterflies have tail-like wing extensions that help confuse predators and avoid attacks."
    },
    {
      "id": "dragonfly",
      "name": "Dragonfly",
      "category": "insects",
      "icon": "🪲",
      "summary": "Fast aerial insect predator.",
      "fact": "Dragonflies have nearly 360-degree vision thanks to their large, multifaceted compound eyes.",
      "activeFact": "Dragonflies can fly in six directions: up, down, forward, backward, left, and right!"
    },
    {
      "id": "damselfly",
      "name": "Damselfly",
      "category": "insects",
      "icon": "🪲",
      "summary": "Slender cousin of dragonflies.",
      "fact": "Damselflies have excellent vision with large, compound eyes that help them catch prey in mid-air.",
      "activeFact": "Damselflies fold their wings back when resting, unlike dragonflies that keep wings open."
    },
    {
      "id": "firefly",
      "name": "Firefly",
      "category": "insects",
      "icon": "✨",
      "summary": "Bioluminescent summer insect.",
      "fact": "Fireflies produce light through a chemical reaction in their lower abdomen called bioluminescence.",
      "activeFact": "Fireflies use bioluminescence to attract mates, creating magical glowing light shows in warm summer nights!"
    },
    {
      "id": "honeybee",
      "name": "Honeybee",
      "category": "insects",
      "icon": "🐝",
      "summary": "Important pollinator species.",
      "fact": "Honeybees have five eyes: two large compound eyes and three smaller simple eyes on top of their heads.",
      "activeFact": "Honeybees communicate by dancing to share the location of tasty flowers with their hive friends!"
    },
    {
      "id": "bumblebee",
      "name": "Bumblebee",
      "category": "insects",
      "icon": "🐝",
      "summary": "Cold-tolerant pollinator.",
      "fact": "Bumblebees use vibrations called \"buzz pollination\" to release pollen from certain flowers.",
      "activeFact": "Bumblebees can fly despite their small wings by beating them about 200 times per second!"
    },
    {
      "id": "grasshopper",
      "name": "Grasshopper",
      "category": "insects",
      "icon": "🦗",
      "summary": "Common jumping insect.",
      "fact": "Grasshoppers produce sound by rubbing their hind legs against their wings, a process called stridulation.",
      "activeFact": "Grasshoppers have powerful hind legs that can leap over 20 times their body length in a single jump!"
    }
  ],
  "factIndex": 8,
  "runId": "2026-02-19T17:55:42Z"
}