{ "lastUpdated": "2026-02-19T20:03:21Z", "critters": [ { "id": "whitetail_deer", "name": "White-tailed Deer", "category": "mammals", "icon": "🦌", "summary": "Common woodland browser often seen near fields and feeders.", "fact": "White-tailed deer can run up to 30 miles per hour to escape predators.", "activeFact": "White-tailed deer can run up to 30 miles per hour to escape predators.", "factHistory": [ "White-tailed deer can run up to 30 miles per hour to escape predators.", "White-tailed deer can run up to 30 miles per hour to escape predators." ] }, { "id": "black_bear", "name": "Black Bear", "category": "mammals", "icon": "🐻", "summary": "Largest forest mammal in Michigan woodlands.", "fact": "Black bears can run up to 30 miles per hour, faster than most humans!", "activeFact": "Black bears have excellent memories and can remember food sources for years!", "factHistory": [ "Black bears have an excellent sense of smell, nearly seven times better than a bloodhound.", "Black bears have an excellent sense of smell, even better than bloodhounds!" ] }, { "id": "coyote", "name": "Coyote", "category": "mammals", "icon": "🐕", "summary": "Adaptable predator common in rural areas.", "fact": "Coyotes communicate using a variety of howls, yips, and barks to coordinate with their pack.", "activeFact": "Coyotes are highly adaptable and can live in deserts, forests, mountains, and even cities!", "factHistory": [ "Coyotes use high-pitched yips and howls to communicate and coordinate with their pack during hunts.", "Coyotes can adapt to diverse habitats, including urban areas, making them highly versatile survivors." ] }, { "id": "red_fox", "name": "Red Fox", "category": "mammals", "icon": "🦊", "summary": "Solitary hunter active in open woods and fields.", "fact": "Red foxes use their bushy tails for balance, warmth, and communication with other foxes.", "activeFact": "Red foxes use their bushy tails for balance and to keep warm during cold weather.", "factHistory": [ "Red foxes use their bushy tails for balance and to keep warm during cold weather.", "Red foxes have excellent hearing, able to detect small animals digging underground." ] }, { "id": "gray_fox", "name": "Gray Fox", "category": "mammals", "icon": "🦊", "summary": "Smaller fox species able to climb trees.", "fact": "Gray foxes can climb trees to escape predators, a rare skill among North American canids.", "activeFact": "Gray foxes can climb trees, an unusual skill for members of the dog family!", "factHistory": [ "Gray foxes are unique canids that can climb trees to escape predators and find food.", "Gray foxes are one of the few canids that can climb trees to escape predators." ] }, { "id": "bobcat", "name": "Bobcat", "category": "mammals", "icon": "🐈", "summary": "Elusive woodland feline predator.", "fact": "Bobcats can leap over 10 feet horizontally to catch prey or escape danger.", "activeFact": "Bobcats can leap up to 10 feet high, helping them catch prey and climb trees quickly!", "factHistory": [ "Bobcats have excellent night vision, aiding their hunting during nighttime or low-light conditions.", "Bobcats can leap up to 10 feet high, making them excellent climbers and hunters." ] }, { "id": "porcupine", "name": "Porcupine", "category": "mammals", "icon": "🦔", "summary": "Slow-moving rodent protected by quills.", "fact": "Porcupines have sharp quills that detach easily to protect themselves from predators.", "activeFact": "Porcupines have thousands of sharp quills that detach easily to protect them from predators.", "factHistory": [ "Porcupines' quills detach easily to deter predators, acting as a unique and effective natural defense.", "Porcupines have up to 30,000 sharp quills for defense, which they cannot shoot but easily detach." ] }, { "id": "beaver", "name": "Beaver", "category": "mammals", "icon": "🦫", "summary": "Dam-building wetland engineer.", "fact": "Beavers' strong teeth can chew through wood as hard as iron, creating their famous dams.", "activeFact": "Beavers build dams to create ponds, helping protect their homes from predators and harsh weather.", "factHistory": [ "Beavers build dams using branches, mud, and rocks to create aquatic habitats for protection and food storage.", "Beavers have transparent eyelids that allow them to see underwater while swimming." ] }, { "id": "muskrat", "name": "Muskrat", "category": "mammals", "icon": "🦫", "summary": "Small aquatic rodent near ponds and streams.", "fact": "Muskrats build dome-shaped lodges from vegetation, providing shelter and protection in aquatic environments.", "activeFact": "Muskrats build dome-shaped lodges from vegetation, similar to beavers, but much smaller and cozier!", "factHistory": [ "Muskrats build dome-shaped lodges from vegetation, which protect them from predators and harsh weather.", "Muskrats build dome-shaped lodges from vegetation, often with underwater entrances for protection against predators." ] }, { "id": "mink", "name": "Mink", "category": "mammals", "icon": "🐾", "summary": "Semi-aquatic predator along shorelines.", "fact": "Minks have waterproof fur that keeps them warm while swimming and hunting in water.", "activeFact": "Minks have waterproof fur, helping them stay dry and warm while swimming underwater for food!", "factHistory": [ "Minks are excellent swimmers, using partially webbed feet to hunt fish and amphibians underwater.", "Minks are semi-aquatic mammals skilled at swimming and hunting fish, small mammals, and birds." ] }, { "id": "fisher", "name": "Fisher", "category": "mammals", "icon": "🐾", "summary": "Forest carnivore related to weasels.", "fact": "Fishers use their agility to hunt porcupines, avoiding quills by targeting face and paws.", "activeFact": "Fishers are skilled climbers and can even chase prey up trees!", "factHistory": [ "Fishers are skilled climbers and use their agility to hunt prey like squirrels and birds.", "Fishers are skilled climbers and use tree cavities for shelter and raising their young." ] }, { "id": "river_otter", "name": "River Otter", "category": "mammals", "icon": "🦦", "summary": "Playful aquatic predator found near rivers.", "fact": "River otters can hold their breath underwater for up to 8 minutes while hunting for food.", "activeFact": "River otters can hold their breath underwater for up to eight minutes while hunting fish.", "factHistory": [ "River otters can close their ears and nostrils underwater to stay submerged while hunting.", "River otters have dense, water-repellent fur that keeps them warm and dry while swimming." ] }, { "id": "gray_squirrel", "name": "Eastern Gray Squirrel", "category": "mammals", "icon": "🐿️", "summary": "Tree squirrel common at feeders.", "fact": "Eastern Gray Squirrels communicate using tail flicks to warn others of nearby predators.", "activeFact": "Eastern Gray Squirrels can rotate their ankles 180 degrees to climb down trees headfirst!", "factHistory": [ "Eastern Gray Squirrels use their bushy tails for balance, communication, and warmth in cold weather.", "Eastern Gray Squirrels can find food buried beneath a foot of snow using memory and smell." ] }, { "id": "red_squirrel", "name": "American Red Squirrel", "category": "mammals", "icon": "🐿️", "summary": "Small territorial woodland squirrel.", "fact": "American Red Squirrels fiercely defend their territory and food caches year-round, showing remarkable aggression.", "activeFact": "American Red Squirrels defend territories year-round, storing food in scattered caches called middens.", "factHistory": [ "American Red Squirrels are fierce defenders of their food caches, aggressively protecting them from intruders.", "American Red Squirrels fiercely defend their food caches from intruders year-round." ] }, { "id": "chipmunk", "name": "Chipmunk", "category": "mammals", "icon": "🐿️", "summary": "Ground squirrel known for cheek pouches.", "fact": "Chipmunks have cheek pouches to carry food back to their burrows for storage.", "activeFact": "Chipmunks have cheek pouches that can expand to carry food back to their burrows for storage.", "factHistory": [ "Chipmunks have cheek pouches that can expand to carry food back to their burrows.", "Chipmunks have cheek pouches that expand to carry food back to their burrows efficiently." ] }, { "id": "snowshoe_hare", "name": "Snowshoe Hare", "category": "mammals", "icon": "🐇", "summary": "Forest rabbit with seasonal coat change.", "fact": "Snowshoe hares change fur color seasonally for camouflage, turning white in winter and brown in summer.", "activeFact": "Snowshoe hares change fur color seasonally, turning white in winter to blend with snow and brown in summer.", "factHistory": [ "Snowshoe hares change fur color seasonally for camouflage, turning white in winter and brown in summer.", "Snowshoe Hares change fur color seasonally, turning white in winter to blend with snow and brown in summer." ] }, { "id": "cottontail", "name": "Eastern Cottontail", "category": "mammals", "icon": "🐇", "summary": "Common backyard rabbit species.", "fact": "Eastern Cottontails use their powerful hind legs to escape predators with quick, zigzag running.", "activeFact": "Eastern Cottontails can run up to 18 miles per hour to escape predators!", "factHistory": [ "Eastern Cottontails use their strong hind legs to make quick, zigzag escapes from predators.", "Eastern Cottontails can run up to 18 miles per hour to escape predators." ] }, { "id": "raccoon", "name": "Raccoon", "category": "night", "icon": "🦝", "summary": "Nocturnal omnivore with dexterous paws.", "fact": "Raccoons have incredibly nimble front paws, allowing them to open jars and solve simple puzzles.", "activeFact": "Raccoons have highly sensitive front paws that help them identify objects by touch, even underwater!", "factHistory": [ "Raccoons have highly sensitive front paws that can remember how to open containers and solve puzzles.", "Raccoons have highly sensitive front paws, allowing them to open containers and solve complex tasks." ] }, { "id": "opossum", "name": "Opossum", "category": "night", "icon": "🐀", "summary": "North America's only marsupial.", "fact": "Opossums have a remarkable immune system that makes them resistant to venom from snakes and insects.", "activeFact": "Opossums play dead to avoid predators, slowing their heartbeat and breathing to appear lifeless.", "factHistory": [ "Opossums have a remarkable immune system that makes them resistant to many snake venoms.", "Opossums are the only North American marsupials, carrying and nursing their babies in a pouch." ] }, { "id": "skunk", "name": "Striped Skunk", "category": "night", "icon": "🦨", "summary": "Night forager known for defensive spray.", "fact": "Striped skunks can spray a foul-smelling liquid up to 10 feet to defend themselves from predators.", "activeFact": "Striped skunks can accurately spray their smelly liquid up to 10 feet to deter predators!", "factHistory": [ "Striped skunks can spray a powerful, foul-smelling liquid up to 10 feet to deter predators.", "Striped skunks can accurately spray a foul-smelling liquid up to 10 feet to deter predators." ] }, { "id": "flying_squirrel", "name": "Flying Squirrel", "category": "night", "icon": "🐿️", "summary": "Gliding nocturnal tree squirrel.", "fact": "Flying squirrels glide using a special membrane called the patagium stretched between their limbs.", "activeFact": "Flying squirrels glide by spreading a flap of skin called a patagium between their legs.", "factHistory": [ "Flying squirrels glide up to 150 feet using a flap of skin between their legs called a patagium.", "Flying squirrels glide using a flap of skin called a patagium stretched between their limbs." ] }, { "id": "little_brown_bat", "name": "Little Brown Bat", "category": "night", "icon": "🦇", "summary": "Common insect-eating bat species.", "fact": "Little Brown Bats use echolocation to catch insects mid-flight, making them efficient nighttime hunters.", "activeFact": "Little Brown Bats can eat up to 1,000 mosquitoes in an hour—nature’s own nighttime pest control!", "factHistory": [ "Little Brown Bats use echolocation to navigate and catch insects in complete darkness.", "Little Brown Bats use echolocation to catch insects mid-air with incredible precision and speed." ] }, { "id": "big_brown_bat", "name": "Big Brown Bat", "category": "night", "icon": "🦇", "summary": "Large bat active near structures.", "fact": "Big Brown Bats use echolocation to hunt insects, navigating and catching prey in complete darkness.", "activeFact": "Big Brown Bats use echolocation to catch insects, helping control mosquito populations naturally at night!", "factHistory": [ "Big Brown Bats use echolocation to catch insects, consuming up to half their body weight nightly.", "Big Brown Bats use echolocation to catch insects mid-flight, consuming thousands each night." ] }, { "id": "barred_owl", "name": "Barred Owl", "category": "night", "icon": "🦉", "summary": "Woodland owl known for 'who cooks for you' call.", "fact": "Barred Owls can rotate their heads almost 270 degrees to spot prey without moving their bodies.", "activeFact": "Barred Owls can mimic the calls of other birds to confuse their prey or rivals.", "factHistory": [ "Barred Owls have distinctive hoots that sound like \"Who cooks for you? Who cooks for you all?\"", "Barred Owls have distinctive hooting calls that sound like \"Who cooks for you? Who cooks for you all?\"" ] }, { "id": "great_horned_owl", "name": "Great Horned Owl", "category": "night", "icon": "🦉", "summary": "Large powerful nocturnal raptor.", "fact": "Great Horned Owls have incredible night vision and can rotate their heads up to 270 degrees.", "activeFact": "Great Horned Owls can rotate their heads up to 270 degrees without harming blood flow!", "factHistory": [ "Great Horned Owls have powerful talons that can crush prey bones, making them top nighttime hunters.", "Great Horned Owls have ear tufts that help with camouflage and communication, not actual ears." ] }, { "id": "bluejay", "name": "Blue Jay", "category": "birds", "icon": "🐦", "summary": "Bold feeder visitor with loud calls.", "fact": "Blue Jays can mimic hawk calls to scare away smaller birds and protect their food caches.", "activeFact": "Blue Jays can mimic hawk calls to scare away other birds and protect their territory.", "factHistory": [ "Blue Jays can mimic the calls of hawks to scare away other birds from their territory.", "Blue Jays can mimic hawk calls to scare away other birds from feeders and territories." ] }, { "id": "cardinal", "name": "Northern Cardinal", "category": "birds", "icon": "🐦‍⬛", "summary": "Bright red year-round songbird.", "fact": "Northern Cardinals are known for their distinctive bright red plumage and melodic, clear whistles.", "activeFact": "Northern Cardinals are one of the few birds where both males and females sing beautifully.", "factHistory": [ "Male Northern Cardinals sing to defend territory and attract mates, making their bright red plumage even more eye-catching.", "Northern Cardinals are one of the few songbirds where males and females sing different songs." ] }, { "id": "chickadee", "name": "Black-capped Chickadee", "category": "birds", "icon": "🐤", "summary": "Small energetic feeder regular.", "fact": "Black-capped Chickadees can remember hundreds of seed hiding spots to find food later.", "activeFact": "Black-capped Chickadees can remember hundreds of hiding spots for their food throughout the winter.", "factHistory": [ "Black-capped Chickadees can remember hundreds of hiding spots for their food during winter.", "Black-capped Chickadees can remember hundreds of hiding spots for their food throughout winter." ] }, { "id": "titmouse", "name": "Tufted Titmouse", "category": "birds", "icon": "🐤", "summary": "Curious small woodland songbird.", "fact": "Tufted Titmice use a variety of calls to communicate and warn others about predators nearby.", "activeFact": "Tufted Titmice use their strong feet to cling upside down while searching for insects on tree bark!", "factHistory": [ "Tufted Titmice can mimic the calls of other birds to communicate or defend their territory.", "Tufted Titmice often cache seeds to eat later, showing impressive memory skills in the wild." ] }, { "id": "nuthatch", "name": "White-breasted Nuthatch", "category": "birds", "icon": "🐦", "summary": "Tree climber often moving headfirst down bark.", "fact": "White-breasted Nuthatches can walk headfirst down tree trunks while searching for insects.", "activeFact": "White-breasted Nuthatches can climb down trees headfirst, unlike many other birds!", "factHistory": [ "White-breasted Nuthatches can climb down trees headfirst, unlike most other birds.", "White-breasted Nuthatches often climb down trees headfirst, unlike most birds that go upward only." ] }, { "id": "downy_woodpecker", "name": "Downy Woodpecker", "category": "birds", "icon": "🐦", "summary": "Small woodpecker common at feeders.", "fact": "Downy Woodpeckers drum rapidly on trees to communicate and establish territory.", "activeFact": "Downy Woodpeckers are the smallest woodpeckers in North America, about the size of a sparrow!", "factHistory": [ "Downy Woodpeckers drum on trees to communicate and find insects hidden beneath the bark.", "Downy Woodpeckers use their stiff tail feathers to brace themselves on tree trunks while pecking." ] }, { "id": "hairy_woodpecker", "name": "Hairy Woodpecker", "category": "birds", "icon": "🐦", "summary": "Larger look-alike of the downy.", "fact": "Hairy Woodpeckers drum on trees to communicate and find insects hidden beneath the bark.", "activeFact": "Hairy Woodpeckers drum on trees to find insects, not just to communicate with other woodpeckers!", "factHistory": [ "Hairy Woodpeckers drum loudly to communicate and find insects hidden under tree bark.", "Hairy Woodpeckers drum rapidly to communicate and establish territory in North American forests." ] }, { "id": "pileated_woodpecker", "name": "Pileated Woodpecker", "category": "birds", "icon": "🪵", "summary": "Large crested forest woodpecker.", "fact": "Pileated Woodpeckers create large rectangular holes when searching for ants and beetle larvae in trees.", "activeFact": "Pileated Woodpeckers can drill holes 3 inches wide to find insects hiding deep in trees!", "factHistory": [ "Pileated Woodpeckers create large rectangular holes in trees to find insects and build nests.", "Pileated Woodpeckers create large rectangular holes in trees to find insects and build nests." ] }, { "id": "red_bellied_woodpecker", "name": "Red-bellied Woodpecker", "category": "birds", "icon": "🐦", "summary": "Common woodland woodpecker species.", "fact": "Red-bellied Woodpeckers use their strong beaks to drum on trees, marking territory and finding insects.", "activeFact": "Red-bellied Woodpeckers have a strong, chisel-like beak to drill into tree bark for insects.", "factHistory": [ "Red-bellied Woodpeckers drum on trees to communicate and mark their territory.", "Red-bellied Woodpeckers drum loudly to communicate and establish territory in their woodland habitats." ] }, { "id": "mourning_dove", "name": "Mourning Dove", "category": "birds", "icon": "🕊️", "summary": "Gentle ground-feeding dove.", "fact": "Mourning Doves are known for their soft, mournful cooing sounds that carry over long distances.", "activeFact": "Mourning Doves can fly up to 55 miles per hour, making them surprisingly fast fliers!", "factHistory": [ "Mourning Doves can fly up to 55 miles per hour to evade predators.", "Mourning Doves can fly up to 55 miles per hour to escape predators and migrate long distances." ] }, { "id": "goldfinch", "name": "American Goldfinch", "category": "birds", "icon": "🐦", "summary": "Bright yellow seasonal finch.", "fact": "American Goldfinches molt twice annually, showing bright yellow breeding plumage only in spring and summer.", "activeFact": "American Goldfinches molt twice a year, changing from bright yellow in summer to duller feathers in winter!", "factHistory": [ "American Goldfinches molt twice yearly, changing bright yellow feathers in summer to duller olive winter plumage.", "American Goldfinches molt twice yearly, changing their bright yellow feathers to olive-brown in winter." ] }, { "id": "junco", "name": "Dark-eyed Junco", "category": "birds", "icon": "🐦", "summary": "Winter feeder bird.", "fact": "Dark-eyed Juncos change their plumage seasonally, becoming brighter in winter to attract mates.", "activeFact": "Dark-eyed Juncos change feather colors seasonally, showing brighter plumage during breeding for attracting mates!", "factHistory": [ "Dark-eyed Juncos change plumage color seasonally, appearing brighter in winter for better camouflage in snow.", "Dark-eyed Juncos change their song patterns regionally, creating unique local bird dialects across North America." ] }, { "id": "house_finch", "name": "House Finch", "category": "birds", "icon": "🐦", "summary": "Small social seed-eater.", "fact": "House Finches are known for their cheerful warbling songs, which vary between individuals and regions.", "activeFact": "House Finches have red feathers on their heads, which actually come from pigments in the foods they eat!", "factHistory": [ "House Finches are native to the western U.S. but now thrive across much of North America.", "House Finches are known for their cheerful, warbling songs used to attract mates and defend territory." ] }, { "id": "purple_finch", "name": "Purple Finch", "category": "birds", "icon": "🐦", "summary": "Rosy-colored woodland finch.", "fact": "Purple Finches have a raspberry-red color that helps males attract mates during breeding season.", "activeFact": "Purple Finches sing sweet, melodious songs that help them attract mates and mark their territory.", "factHistory": [ "Purple Finches have a distinctive raspberry red plumage that helps males attract mates during breeding season.", "Purple Finches have a raspberry-red head and chest, making them easy to spot in North American forests." ] }, { "id": "wild_turkey", "name": "Wild Turkey", "category": "birds", "icon": "🦃", "summary": "Large ground bird common in Michigan.", "fact": "Wild turkeys can run up to 20 miles per hour and fly short distances at 55 miles per hour.", "activeFact": "Wild turkeys can fly at speeds up to 55 miles per hour for short bursts!", "factHistory": [ "Wild turkeys can fly short distances at speeds up to 55 miles per hour.", "Wild turkeys can run up to 20 miles per hour and fly short distances at 55 miles per hour." ] }, { "id": "ruffed_grouse", "name": "Ruffed Grouse", "category": "birds", "icon": "🐓", "summary": "Forest bird known for drumming display.", "fact": "Ruffed Grouse create loud drumming sounds by rapidly beating their wings to attract mates.", "activeFact": "Ruffed Grouse create a drumming sound by beating their wing feathers to attract mates and mark territory.", "factHistory": [ "Ruffed Grouse create a drumming sound by beating air with their wings to attract mates.", "Ruffed Grouse create a drumming sound by beating air with their wings to attract mates." ] }, { "id": "sandhill_crane", "name": "Sandhill Crane", "category": "birds", "icon": "🕊️", "summary": "Tall wetland bird with loud call.", "fact": "Sandhill Cranes perform elaborate dances to communicate and strengthen pair bonds.", "activeFact": "Sandhill Cranes perform graceful, synchronized dances to strengthen pair bonds and communicate with each other.", "factHistory": [ "Sandhill Cranes perform synchronized dancing to strengthen pair bonds.", "Sandhill Cranes perform intricate group dances involving bowing, jumping, and wing-flapping to communicate and bond." ] }, { "id": "crow", "name": "American Crow", "category": "birds", "icon": "🐦‍⬛", "summary": "Highly intelligent black bird.", "fact": "American Crows use tools and can recognize individual human faces in their environment.", "activeFact": "American Crows can recognize human faces and remember if someone is a threat for years.", "factHistory": [ "American Crows can recognize human faces and remember if a person is threatening or friendly.", "American Crows can recognize human faces and remember those who pose threats." ] }, { "id": "raven", "name": "Common Raven", "category": "birds", "icon": "🐦‍⬛", "summary": "Large intelligent corvid species.", "fact": "Common Ravens can mimic human speech and other sounds they hear in their environment.", "activeFact": "Common Ravens can mimic sounds, including human speech and animal calls, showing impressive intelligence.", "factHistory": [ "Common Ravens can mimic human speech and other sounds in their environment with surprising accuracy.", "Common Ravens can mimic sounds from their environment, including human speech and animal calls." ] }, { "id": "red_tailed_hawk", "name": "Red-tailed Hawk", "category": "birds", "icon": "🦅", "summary": "Common soaring raptor.", "fact": "Red-tailed Hawks can soar up to 1,000 feet while searching for prey below.", "activeFact": "Red-tailed Hawks can spot prey from over a mile away using their incredible eyesight!", "factHistory": [ "Red-tailed Hawks use their keen eyesight to spot prey from over a mile away during flight.", "Red-tailed Hawks use their sharp vision to spot prey from over a mile away." ] }, { "id": "coopers_hawk", "name": "Cooper’s Hawk", "category": "birds", "icon": "🦅", "summary": "Fast woodland hunting hawk.", "fact": "Cooper’s Hawks have incredible agility, allowing them to swiftly navigate dense trees while hunting birds.", "activeFact": "Cooper’s Hawks are skilled flyers that use surprise attacks to catch birds mid-air.", "factHistory": [ "Cooper’s Hawks are agile fliers, using quick twists to catch birds mid-air in dense forests.", "Cooper’s Hawks are agile hunters, known for dashing through dense trees to catch small birds mid-flight." ] }, { "id": "mallard", "name": "Mallard Duck", "category": "water", "icon": "🦆", "summary": "Common freshwater duck.", "fact": "Mallard ducks can recognize and remember individual human faces for years.", "activeFact": "Mallard ducks can recognize and remember individual human faces for years.", "factHistory": [ "Mallard ducks can sleep with one eye open to stay alert for predators.", "Mallard ducks are known for their distinctive green heads and loud quacking calls during mating season." ] }, { "id": "wood_duck", "name": "Wood Duck", "category": "water", "icon": "🦆", "summary": "Colorful duck nesting in tree cavities.", "fact": "Wood Ducks often nest in tree cavities, making them unique among North American waterfowl species.", "activeFact": "Wood Ducks nest in tree cavities, making them unique among North American waterfowl species.", "factHistory": [ "Wood Ducks nest in tree cavities and are one of the most colorful North American waterfowl species.", "Wood Ducks nest in tree cavities and their ducklings can jump from great heights safely after hatching." ] }, { "id": "canada_goose", "name": "Canada Goose", "category": "water", "icon": "🪿", "summary": "Migratory waterfowl species.", "fact": "Canada Geese can fly over 1,500 miles during migration, navigating using the sun and Earth's magnetic field.", "activeFact": "Canada Geese can fly thousands of miles during migration, often forming a distinctive V-shaped flying pattern.", "factHistory": [ "Canada Geese can fly thousands of miles during migration using strong, graceful V-shaped formations.", "Canada Geese can fly thousands of miles during migration using a distinctive V-formation to conserve energy." ] }, { "id": "great_blue_heron", "name": "Great Blue Heron", "category": "water", "icon": "🦤", "summary": "Large fish-eating wading bird.", "fact": "Great Blue Herons can fly at speeds up to 30 miles per hour while hunting for fish.", "activeFact": "Great Blue Herons can fly at speeds up to 30 miles per hour while hunting for fish.", "factHistory": [ "Great Blue Herons use their long necks like a spear to catch fish with lightning-fast strikes.", "Great Blue Herons use their sharp beaks to spear fish with lightning-fast precision." ] }, { "id": "painted_turtle", "name": "Painted Turtle", "category": "water", "icon": "🐢", "summary": "Common basking turtle.", "fact": "Painted turtles absorb heat through their colorful shells to regulate body temperature while basking in the sun.", "activeFact": "Painted Turtles can absorb oxygen through their skin while underwater, helping them stay submerged longer.", "factHistory": [ "Painted turtles can absorb oxygen through their skin while underwater, helping them stay submerged longer.", "Painted Turtles can absorb oxygen through their skin while underwater, allowing extended dives." ] }, { "id": "snapping_turtle", "name": "Snapping Turtle", "category": "water", "icon": "🐢", "summary": "Large aquatic turtle.", "fact": "Snapping turtles have powerful jaws that can snap shut in less than 30 milliseconds.", "activeFact": "Snapping turtles have powerful jaws and can snap shut in less than a second to catch prey!", "factHistory": [ "Snapping turtles have powerful jaws strong enough to snap small bones and catch fish quickly.", "Snapping turtles have powerful jaws that can snap shut with incredible force to catch prey." ] }, { "id": "bluegill", "name": "Bluegill", "category": "water", "icon": "🐟", "summary": "Common freshwater panfish.", "fact": "Bluegill can rapidly change color to communicate mood and improve camouflage in their environment.", "activeFact": "Bluegill fish can hear sounds up to 1,600 Hz, helping them detect predators quickly underwater!", "factHistory": [ "Bluegill can breathe air by gulping surface air when oxygen levels in water are low.", "Bluegill can breathe air through their skin in low-oxygen water conditions." ] }, { "id": "largemouth_bass", "name": "Largemouth Bass", "category": "water", "icon": "🐟", "summary": "Popular freshwater predator fish.", "fact": "Largemouth bass can change color to blend with their environment for better hunting and protection.", "activeFact": "Largemouth bass can grow over 2 feet long and use their big mouths to ambush prey!", "factHistory": [ "Largemouth bass can expand their jaws to swallow prey over half their own body length.", "Largemouth bass can grow over 20 pounds and have a distinctive jaw that extends past their eyes." ] }, { "id": "yellow_perch", "name": "Yellow Perch", "category": "water", "icon": "🐟", "summary": "Schooling freshwater fish.", "fact": "Yellow Perch have distinctive vertical stripes and are popular for both sport fishing and cooking.", "activeFact": "Yellow Perch have vibrant yellow bodies with dark vertical stripes, making them easy to spot underwater!", "factHistory": [ "Yellow Perch have bright yellow bodies with dark vertical stripes, making them easy to spot underwater.", "Yellow Perch have distinct vertical stripes that help them blend into underwater vegetation." ] }, { "id": "northern_pike", "name": "Northern Pike", "category": "water", "icon": "🐟", "summary": "Fast ambush predator fish.", "fact": "Northern Pike can grow over 4 feet long and strike prey with lightning-fast speed.", "activeFact": "Northern Pike can grow over 4 feet long and use sharp teeth to catch their prey swiftly!", "factHistory": [ "Northern Pike use ambush tactics, staying still before quickly striking prey with sharp teeth.", "Northern Pike have sharp teeth and ambush prey using quick bursts of speed." ] }, { "id": "spring_peeper", "name": "Spring Peeper", "category": "amphib_reptile", "icon": "🐸", "summary": "Tiny frog with loud spring calls.", "fact": "Spring Peepers use their loud, high-pitched calls to attract mates during early spring nights.", "activeFact": "Spring Peepers are tiny frogs known for their loud, high-pitched calls signaling early spring.", "factHistory": [ "Spring Peepers are tiny frogs known for their loud, high-pitched peeping calls during early spring nights.", "Spring Peepers are tiny frogs known for their loud, high-pitched calls that signal the start of spring." ] }, { "id": "bullfrog", "name": "American Bullfrog", "category": "amphib_reptile", "icon": "🐸", "summary": "Large pond frog.", "fact": "American Bullfrogs can produce loud, deep calls audible over a mile away.", "activeFact": "American Bullfrogs can grow up to 8 inches long, making them one of North America's largest frogs!", "factHistory": [ "American Bullfrogs can produce deep, loud calls that travel over half a mile to attract mates.", "American Bullfrogs can produce deep, loud croaks that carry over long distances to attract mates." ] }, { "id": "green_frog", "name": "Green Frog", "category": "amphib_reptile", "icon": "🐸", "summary": "Common shoreline frog.", "fact": "Green frogs can create distinctive twanging calls by inflating their vocal sacs underwater.", "activeFact": "Green frogs can jump over 20 times their body length to escape predators quickly!", "factHistory": [ "Green frogs can produce a distinctive, banjo-like call heard during warm, rainy nights.", "Green Frogs can jump over 20 times their body length to catch prey or escape predators." ] }, { "id": "leopard_frog", "name": "Leopard Frog", "category": "amphib_reptile", "icon": "🐸", "summary": "Spotted frog near wetlands.", "fact": "Leopard frogs use their powerful legs to leap up to three feet in a single jump.", "activeFact": "Leopard frogs get their name from their distinctive dark spots that look like a leopard’s coat.", "factHistory": [ "Leopard frogs have distinctive dark spots and are excellent jumpers, often leaping over 3 feet in a single bound.", "Leopard frogs can jump over 20 times their body length to escape predators quickly." ] }, { "id": "garter_snake", "name": "Garter Snake", "category": "amphib_reptile", "icon": "🐍", "summary": "Common harmless snake.", "fact": "Garter snakes can release a foul-smelling musk to deter predators when threatened.", "activeFact": "Garter snakes can swim and often hunt amphibians in water, making them excellent swimmers!", "factHistory": [ "Garter snakes can detect chemicals in the environment using their forked tongues and Jacobson’s organ.", "Garter snakes can swim and often hunt amphibians and fish in water." ] }, { "id": "water_snake", "name": "Water Snake", "category": "amphib_reptile", "icon": "🐍", "summary": "Semi-aquatic snake species.", "fact": "Water snakes can stay underwater for up to an hour while hunting or escaping predators.", "activeFact": "Water snakes can hold their breath underwater for up to two hours while hunting or hiding from predators!", "factHistory": [ "Water snakes can hold their breath underwater for up to 20 minutes while hunting or hiding.", "Water snakes can hold their breath underwater for up to 30 minutes while hunting." ] }, { "id": "milk_snake", "name": "Eastern Milk Snake", "category": "amphib_reptile", "icon": "🐍", "summary": "Non-venomous woodland snake.", "fact": "Eastern Milk Snakes mimic venomous rattlesnakes by vibrating their tails to deter predators.", "activeFact": "Eastern Milk Snakes mimic venomous coral snakes with similar coloring to avoid predators.", "factHistory": [ "Eastern Milk Snakes vibrate their tails like rattlesnakes to mimic dangerous snakes and avoid predators.", "Eastern Milk Snakes mimic venomous coral snakes with their colorful patterns to avoid predators." ] }, { "id": "monarch", "name": "Monarch Butterfly", "category": "insects", "icon": "🦋", "summary": "Migratory butterfly species.", "fact": "Monarch butterflies migrate up to 3,000 miles between North America and Mexico each year.", "activeFact": "Monarch butterflies migrate up to 3,000 miles to Mexico each fall, one of nature’s greatest journeys!", "factHistory": [ "Monarch butterflies migrate up to 3,000 miles between Canada and Mexico each year.", "Monarch butterflies migrate up to 3,000 miles from North America to central Mexico each year." ] }, { "id": "swallowtail", "name": "Swallowtail Butterfly", "category": "insects", "icon": "🦋", "summary": "Large colorful butterfly.", "fact": "Swallowtail butterflies have unique tail-like extensions on their hindwings resembling a bird’s swallow tail.", "activeFact": "Swallowtail butterflies have tail-like wing extensions that help confuse predators and avoid attacks.", "factHistory": [ "Swallowtail butterflies flutter with distinctive tail-like wing extensions that mimic bird feathers for protection.", "Swallowtail butterflies use their tail-like wing extensions to confuse predators during flight." ] }, { "id": "dragonfly", "name": "Dragonfly", "category": "insects", "icon": "🪲", "summary": "Fast aerial insect predator.", "fact": "Dragonflies can fly in six directions: up, down, forward, backward, and side to side with great agility.", "activeFact": "Dragonflies can fly in six directions: up, down, forward, backward, left, and right!", "factHistory": [ "Dragonflies can fly up to 30 miles per hour, making them some of the fastest insects.", "Dragonflies can fly up to 30 miles per hour, making them some of the fastest insects in the world." ] }, { "id": "damselfly", "name": "Damselfly", "category": "insects", "icon": "🪲", "summary": "Slender cousin of dragonflies.", "fact": "Damselflies fold their wings along their bodies when at rest, unlike dragonflies that hold them open.", "activeFact": "Damselflies fold their wings back when resting, unlike dragonflies that keep wings open.", "factHistory": [ "Damselflies fold their wings along their body when resting, unlike dragonflies that keep them open.", "Damselflies fold their wings neatly over their bodies when at rest, unlike dragonflies." ] }, { "id": "firefly", "name": "Firefly", "category": "insects", "icon": "✨", "summary": "Bioluminescent summer insect.", "fact": "Fireflies produce light through a chemical reaction called bioluminescence to attract mates and deter predators.", "activeFact": "Fireflies use bioluminescence to attract mates, creating magical glowing light shows in warm summer nights!", "factHistory": [ "Fireflies use bioluminescent light to attract mates and communicate in the dark.", "Fireflies use bioluminescence to communicate, especially for mating signals during warm summer nights." ] }, { "id": "honeybee", "name": "Honeybee", "category": "insects", "icon": "🐝", "summary": "Important pollinator species.", "fact": "Honeybees communicate by performing a unique \"waggle dance\" to share food locations with hive mates.", "activeFact": "Honeybees communicate by dancing to share the location of tasty flowers with their hive friends!", "factHistory": [ "Honeybees communicate by dancing to share the location of flowers with their hive mates.", "Honeybees communicate by dancing to share the location of food sources with their hive mates." ] }, { "id": "bumblebee", "name": "Bumblebee", "category": "insects", "icon": "🐝", "summary": "Cold-tolerant pollinator.", "fact": "Bumblebees can regulate their body temperature, allowing them to fly in cooler weather than many other bees.", "activeFact": "Bumblebees can fly despite their small wings by beating them about 200 times per second!", "factHistory": [ "Bumblebees have hairy bodies that help them collect and transfer pollen between flowers efficiently.", "Bumblebees can regulate their body temperature to fly in cold weather unlike most other bees." ] }, { "id": "grasshopper", "name": "Grasshopper", "category": "insects", "icon": "🦗", "summary": "Common jumping insect.", "fact": "Grasshoppers can jump up to 20 times their body length using powerful hind legs.", "activeFact": "Grasshoppers have powerful hind legs that can leap over 20 times their body length in a single jump!", "factHistory": [ "Grasshoppers can leap over 20 times their own body length in a single jump.", "Grasshoppers can leap up to 20 times their body length using powerful hind legs." ] } ], "factIndex": 8, "runId": "2026-02-19T19:30:06Z", "cursor": 0 }
